type datasetType = {
  [key: string]: Array<Array<string>>;
};

export const hiraganaSet: datasetType = {
  아: [
    ["あ", "아"],
    ["い", "이"],
    ["う", "우"],
    ["え", "에"],
    ["お", "오"],
  ],
  카: [
    ["か", "카"],
    ["き", "키"],
    ["く", "쿠"],
    ["け", "케"],
    ["こ", "코"],
  ],
  나: [
    ["な", "나"],
    ["に", "니"],
    ["ぬ", "누"],
    ["ね", "네"],
    ["の", "노"],
  ],
  하: [
    ["は", "하"],
    ["ひ", "히"],
    ["ふ", "후"],
    ["へ", "헤"],
    ["ほ", "호"],
  ],
  마: [
    ["ま", "마"],
    ["み", "미"],
    ["む", "무"],
    ["め", "메"],
    ["も", "모"],
  ],
  사: [
    ["さ", "사"],
    ["し", "시"],
    ["す", "스"],
    ["せ", "세"],
    ["そ", "소"],
  ],
  타: [
    ["た", "타"],
    ["ち", "치"],
    ["つ", "츠"],
    ["て", "테"],
    ["と", "토"],
  ],
};
